# პითონში ინფორმაციის მონაცემები იყოფა 2 ნაწილად: ტექსტური მონაცემი (string, str()) და რიცხვითი მონაცემი (integer, int()). ასევე რიცხვითი მონაცემი იყოფა 2 ნაწილად: მთელი რიცხვი (integer, int()) და ათწილადი (float)

num1 = 6
num2 = 4

print(6 + 4)
print(6 - 4)
print(6 * 4)
print(6 / 4)
print(6 % 4)
print(6 ** 4)

num1 = 10
num2 = 15

print(10 + 15)
print(10 - 15)
print(10 * 15)
print(10 / 15)
print(10 % 15)
print(10 ** 15)

num1 = 10
num2 = 20

print(10 + 20)
print(10 -20)
print(10 * 20)
print(10 / 20)
print(10 % 20)
print(10 ** 20)

# / და % (გაყოფა და ნაშთიანი გაყოფა) განსხვავდება იმით რომ, / - გაყოფის დროს ციფრი იყოფა და ტერმინალზე პასუხს გვაძლევს. % - ნაშთიანი გაყოფის დროს გვაძლევს მხოლოდ ნაშთს.

num1 = 14 #ძმა
num2 = 43 #დედა
num3 = 53 #მამა

print(num1 + num2 + num3)